cmsis-svd/cmsis-svd/data/Spansion/MB9AFA3xM.svd
        <!-- REGISTER "IRQ24MON" -->
        <register>
          <name>IRQ24MON</name>
          <description>IRQ24 Batch Read Register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADCINT3" -->
            <field>
              <name>ADCINT3</name>
              <description>Conversion result comparison interrupt request in the corresponding A/D unit 0. </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT2" -->
            <field>
              <name>ADCINT2</name>
              <description>FIFO overrun interrupt request in the corresponding A/D unit 0. </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT1" -->
            <field>
              <name>ADCINT1</name>
              <description>Scan conversion interrupt request in the corresponding A/D unit 0. </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT0" -->
            <field>
              <name>ADCINT0</name>
              <description>Priority conversion interrupt request in the corresponding A/D unit 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ25MON" -->
        <register>
          <name>IRQ25MON</name>
          <description>IRQ25 Batch Read Register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FRT0INT5" -->
            <field>
              <name>FRT0INT5</name>
              <description>Zero detection interrupt request on the free run timer ch.2 in the MFT unit 0</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT0INT4" -->
            <field>
              <name>FRT0INT4</name>
              <description>Zero detection interrupt request on the free run timer ch.1 in the MFT unit 0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT0INT3" -->
            <field>
              <name>FRT0INT3</name>
              <description>Zero detection interrupt request on the free run timer ch.0 in the MFT unit 0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT0INT2" -->
            <field>
              <name>FRT0INT2</name>
              <description>Peak value detection interrupt request on the free run timer ch.2 in the MFT unit 0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT0INT1" -->
            <field>
              <name>FRT0INT1</name>
              <description>Peak value detection interrupt request on the free run timer ch.1 in the MFT unit 0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT0INT0" -->
            <field>
              <name>FRT0INT0</name>
              <description>Peak value detection interrupt request on the free run timer ch.0 in the MFT unit 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ26MON" -->
        <register>
          <name>IRQ26MON</name>
          <description>IRQ26 Batch Read Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ICU0INT3" -->
            <field>
              <name>ICU0INT3</name>
              <description>Interrupt request on the input capture ch.3 in the MFT unit 0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU0INT2" -->
            <field>
              <name>ICU0INT2</name>
              <description>Interrupt request on the input capture ch.2 in the MFT unit 0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU0INT1" -->
            <field>
              <name>ICU0INT1</name>
              <description>Interrupt request on the input capture ch.1 in the MFT unit 0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICU0INT0" -->
            <field>
              <name>ICU0INT0</name>
              <description>Interrupt request on the input capture ch.0 in the MFT unit 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ27MON" -->
        <register>
          <name>IRQ27MON</name>
          <description>IRQ27 Batch Read Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OCU0INT5" -->
            <field>
              <name>OCU0INT5</name>
              <description>Interrupt request on the output compare ch.5 in the MFT unit 0 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU0INT4" -->
            <field>
              <name>OCU0INT4</name>
              <description>Interrupt request on the output compare ch.4 in the MFT unit 0 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU0INT3" -->
            <field>
              <name>OCU0INT3</name>
              <description>Interrupt request on the output compare ch.3 in the MFT unit 0 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU0INT2" -->
            <field>
              <name>OCU0INT2</name>
              <description>Interrupt request on the output compare ch.2 in the MFT unit 0 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU0INT1" -->
            <field>
              <name>OCU0INT1</name>
              <description>Interrupt request on the output compare ch.1 in the MFT unit 0 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCU0INT0" -->
            <field>
              <name>OCU0INT0</name>
              <description>Interrupt request on the output compare ch.0 in the MFT unit 0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
